package ua.com.itproekt.gup.model.profiles;

public enum Nace {

    A ("Сільське господарство, лісове господарство та рибне господарство"),
    B ("Добувна промисловість і розроблення кар'єрів"),
    C ("Переробна промисловість"),
    D ("Постачання електроенергії, газу, пари та кондиційованого повітря"),
    E ("Водопостачання; каналізація, поводження з відходами"),
    F ("Будівництво"),
    G ("Оптова та роздрібна торгівля; ремонт автотранспортних засобів і мотоциклів"),
    H ("Транспорт, складське господарство, поштова та кур'єрська діяльність"),
    I ("Тимчасове розміщування й організація харчування"),
    J ("Інформація та телекомунікації"),
    K ("Фінансова та страхова діяльність"),
    L ("Операції з нерухомим майном"),
    M ("Професійна, наукова та технічна діяльність"),
    N ("Діяльність у сфері адміністративного та допоміжного обслуговування"),
    O ("Державне управління й оборона; обов'язкове соціальне страхування"),
    P ("Освіта"),
    Q ("Охорона здоров'я та надання соціальної допомоги"),
    R ("Мистецтво, спорт, розваги та відпочинок"),
    S ("Надання інших видів послуг"),
    T ("Діяльність домашніх господарств"),
    U ("Діяльність екстериторіальних організацій і органів");
    private final String value;

    Nace(String value){
        this.value = value;
    }
}
